# RoomsReallyFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..RoomsReallyFailed Property
BuiltInFailures..::..RoomFailures Class See Also
---
[Room] computations failed. Try to modify the following elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RoomsReallyFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomsReallyFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RoomsReallyFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace